# <span style="color:#130654; font-family: Helvetica; font-size: 200%; font-weight:700"> Pandas | <span style="font-size: 50%; font-weight:300">Joining DataFrames</span>

<br>

To use pandas in python import it first by using the following command:

In [67]:
# import pandas
import pandas as pd

<br>

### <span style="color:#130654">Create DataFrame</span>

In [3]:
left = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5']})

right = pd.DataFrame(
   {'id':[1,2,3,4,5],
   'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
   'subject_id':['sub2','sub4','sub3','sub6','sub5']})

<br>

### <span style="color:#130654">merge()</span>

`merge()` function is used to merge DataFrame or named Series objects with a database-style join.

The join is done on columns or indexes. If joining columns on columns, the DataFrame indexes will be ignored. Otherwise if joining indexes on indexes or indexes on a column or columns, the index will be passed on

*Syntax:*
```python
DataFrame.merge(self, right, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False, sort=False, suffixes=('_x', '_y'), copy=True, indicator=False, validate=None)
```

|      Name       | Description                                                  | Type                  | Required |
| :-------------: | :----------------------------------------------------------- | :---------------------------------- | :------------------ |
|    **right**    | Object to merge with.                                        | DataFrame or named Series           | Required            |
|     **how**     | One of 'left', 'right', 'outer', 'inner'. Defaults to inner. Each method has been described below. | {'left', 'right', 'outer', 'inner'} | Required            |
|     **on**      | Columns (names) to join on. Must be found in both the left and right DataFrame objects. | label or list                       | Required            |
|   **left_on**   | Columns from the left DataFrame to use as keys. Can either be column names or arrays with length equal to the length of the DataFrame. | label or list, or array-like        | Required            |
|  **right_on**   | Columns from the right DataFrame to use as keys. Can either be column names or arrays with length equal to the length of the DataFrame. | label or list, or array-like        | Required            |
| **left_index**  | If **True,** use the index (row labels) from the left DataFrame as its join key(s). In case of a DataFrame with a MultiIndex (hierarchical), the number of levels must match the number of join keys from the right DataFrame. | bool                                | Required            |
| **right_index** | Same usage as **left_index** for the right DataFrame.        | bool                                | Required            |
|    **sort**     | Sort the join keys lexicographically in the result DataFrame. If False, the order of the join keys depends on the join type (how keyword). | bool                                | Required            |
|  **suffixes**   | Suffix to apply to overlapping column names in the left and right side, respectively. | tuple of (str, str)                 | Required            |
|    **copy**     | If False, avoid copy if possible.                            | bool                                | Required            |
|  **indicator**  | If True, adds a column to output DataFrame called "_merge" with information on the source of each row. | bool or str                         | Required            |
|  **validate**   | If specified, checks if merge is of specified type. Each method has been described below. | str                                 | optional            |

*Returns:*
> A DataFrame of the two merged objects.

<br>

#### *Example 1:* Merge Two DataFrames on a Key

In [4]:
df_merge_key = pd.merge(left,right,on='id')
df_merge_key

   id  Name_x subject_id_x Name_y subject_id_y
0   1    Alex         sub1  Billy         sub2
1   2     Amy         sub2  Brian         sub4
2   3   Allen         sub4   Bran         sub3
3   4   Alice         sub6  Bryce         sub6
4   5  Ayoung         sub5  Betty         sub5

#### *Example 2:* Merge Two DataFrames on Multiple Keys

In [6]:
df_merge_multikey = pd.merge(left,right,on=['id','subject_id'])
df_merge_multikey

   id  Name_x subject_id Name_y
0   4   Alice       sub6  Bryce
1   5  Ayoung       sub5  Betty

#### *Example 3:* Merge Using 'how' Argument

| Merge Method | SQL Equivalent   | Description                |
| :----------: | :--------------- | :------------------------- |
|   **left**   | LEFT OUTER JOIN  | Use keys from left object  |
|  **right**   | RIGHT OUTER JOIN | Use keys from right object |
|  **outer**   | FULL OUTER JOIN  | Use union of keys          |
|  **inner**   | INNER JOIN       | Use intersection of keys   |

##### Left Join

In [16]:
df_merge_left = pd.merge(left, right, on='subject_id', how='left', suffixes=('_left', '_right'))
df_merge_left

   id_left Name_left subject_id  id_right Name_right
0        1      Alex       sub1       NaN        NaN
1        2       Amy       sub2       1.0      Billy
2        3     Allen       sub4       2.0      Brian
3        4     Alice       sub6       4.0      Bryce
4        5    Ayoung       sub5       5.0      Betty

##### Right Join

In [17]:
df_merge_right = pd.merge(left, right, on='subject_id', how='right', suffixes=('_left', '_right'))
df_merge_right

   id_left Name_left subject_id  id_right Name_right
0      2.0       Amy       sub2         1      Billy
1      3.0     Allen       sub4         2      Brian
2      4.0     Alice       sub6         4      Bryce
3      5.0    Ayoung       sub5         5      Betty
4      NaN       NaN       sub3         3       Bran

##### Outer Join

In [18]:
df_merge_out = pd.merge(left, right, on='subject_id', how='outer', suffixes=('_left', '_right'))
df_merge_out

   id_left Name_left subject_id  id_right Name_right
0      1.0      Alex       sub1       NaN        NaN
1      2.0       Amy       sub2       1.0      Billy
2      3.0     Allen       sub4       2.0      Brian
3      4.0     Alice       sub6       4.0      Bryce
4      5.0    Ayoung       sub5       5.0      Betty
5      NaN       NaN       sub3       3.0       Bran

##### Inner Join

In [19]:
df_merge_in = pd.merge(left, right, on='subject_id', how='inner', suffixes=('_left', '_right'))
df_merge_in

   id_left Name_left subject_id  id_right Name_right
0        2       Amy       sub2         1      Billy
1        3     Allen       sub4         2      Brian
2        4     Alice       sub6         4      Bryce
3        5    Ayoung       sub5         5      Betty

<br>

### <span style="color:#130654">join()</span>

`join()` function is used to join columns of another DataFrame.
- Join columns with other DataFrame either on index or on a key column. 
- Efficiently join multiple DataFrame objects by index at once by passing a list.

*Syntax:*
```python
DataFrame.join(self, other, on=None, how='left', lsuffix='', rsuffix='', sort=False)
```

|    Name     | Description                                                  | Type                                    | Required |
| :---------: | :----------------------------------------------------------- | :-------------------------------------- | :------- |
|  **other**  | Index should be similar to one of the columns in this one. If a Series is passed, its name attribute must be set, and that will be used as the column name in the resulting joined DataFrame. | DataFrame, Series, or list of DataFrame | Required |
|   **on**    | Column or index level name(s) in the caller to join on the index in other, otherwise joins index-on-index. If multiple values given, the other DataFrame must have a MultiIndex. Can pass an array as the join key if it is not already contained in the calling DataFrame. Like an Excel VLOOKUP operation. | str, list of str, or array-like         | Optional |
|   **how**   | How to handle the operation of the two objects.<br />1. left: use calling frame's index (or column if on is specified)<br />2. right: use other's index.<br />3. outer: form union of calling frame's index (or column if on is specified) with other's index, and sort it. lexicographically.<br />4. inner: form intersection of calling frame's index (or column if on is specified) with other's index, preserving the order of the calling's one. | {'left', 'right', 'outer', 'inner'}     | Required |
| **lsuffix** | Suffix to use from right frame's overlapping columns.        | str                                     | Required |
| **rsuffix** | Suffix to use from right frame's overlapping columns.        | str                                     | Required |
|  **sort**   | Order result DataFrame lexicographically by the join key. If False, the order of the join key depends on the join type (how keyword). | bool                                    | Required |

*Return:*
> Dataframe

In [20]:
df_join = left.join(right, lsuffix='_caller', rsuffix='_other')
df_join

,id_caller,Name_caller,subject_id_caller,id_other,Name_other,subject_id_other
0,1,Alex,sub1,1,Billy,sub2
1,2,Amy,sub2,2,Brian,sub4
2,3,Allen,sub4,3,Bran,sub3
3,4,Alice,sub6,4,Bryce,sub6
4,5,Ayoung,sub5,5,Betty,sub5

If you want to join using the key columns, you need to set key to be the index in both df and other.

The joined DataFrame will have key as its index.

In [22]:
df_join_index = left.set_index('id').join(right.set_index('id'), lsuffix='_left', rsuffix='_right')
df_join_index

   Name_left subject_id_left Name_right subject_id_right
id
1       Alex            sub1      Billy             sub2
2        Amy            sub2      Brian             sub4
3      Allen            sub4       Bran             sub3
4      Alice            sub6      Bryce             sub6
5     Ayoung            sub5      Betty             sub5

Another option to join using the key columns is to use the on parameter. DataFrame.join always uses other’s index but we can use any column in df.

This method preserves the original DataFrame’s index in the result.

In [26]:
df_join_on = left.join(right.set_index('id'), on='id', lsuffix = '_left', rsuffix='_right')
df_join_on

   id Name_left subject_id_left Name_right subject_id_right
0   1      Alex            sub1      Billy             sub2
1   2       Amy            sub2      Brian             sub4
2   3     Allen            sub4       Bran             sub3
3   4     Alice            sub6      Bryce             sub6
4   5    Ayoung            sub5      Betty             sub5

<br>

#### Difference between merge() and join():

- We can use join and merge to combine 2 dataframes.
- The join method works best when we are joining dataframes on their indexes (though you can specify another column to join on for the left dataframe).
- The merge method is more versatile and allows us to specify columns besides the index to join on for both dataframes. If the index gets reset to a counter post merge, we can use set_index to change it back.

<br>

### <span style="color:#130654">concat()</span>

`concat()` function is used to concatenate pandas objects along a particular axis with optional set logic along the other axes.

*Syntax:*
```python
pandas.concat(objs, axis=0, join='outer', join_axes=None, ignore_index=False, keys=None, levels=None, names=None, verify_integrity=False, sort=None, copy=True)
```

|         Name         | Description                                                  | Type                        | Default | Required |
| :------------------: | :----------------------------------------------------------- | :-------------------------- | :------ | :------- |
|       **objs**       | A sequence or mapping of Series or DataFrame objects. If a dict is passed, the sorted keys will be used as the keys argument, unless it is passed, in which case the values will be selected. | Series or DataFrame objects |         | Required |
|       **axis**       | The axis to concatenate along.                               | {0/’index’, 1/’columns’}    | 0       | Optional |
|       **join**       | Handle indexes on other axis (or axes).                      | {‘inner’, ‘outer’}          | ‘outer’ | Optional |
|     **left_on**      | Field name to join on in left DataFrame.                     | label                       |         | Optional |
|   **ignore_index**   | Useful to concate objects where the concatenation axis does not have meaningful indexing information. | bool                        | False   | Optional |
|       **keys**       | Construct hierarchical index using the passed keys as the outermost level. | sequence                    | None    | Optional |
|      **levels**      | Specific levels (unique values) to use for constructing a MultiIndex. Otherwise they will be inferred from the keys. | list of sequences           | None    | Optional |
|      **names**       | Names for the levels in the resulting hierarchical index.    | list                        | None    | Optional |
| **verify_integrity** | Field names to match on in the left DataFrame.               | bool                        | False   | Optional |
|       **sort**       | Sort non-concatenation axis if it is not already aligned when join is "outer". | bool                        | None    | Optional |
|       **copy**       | Suffix to apply to overlapping column names in the left and right side, respectively. | bool                        | True    | Optional |

*Return:*
> Object

Types of object:
- When concatenating all Series along the index (axis=0), a Series is returned.
- When objs contains at least one DataFrame, a DataFrame is returned.
- When concatenating along the columns (axis=1), a DataFrame is returned.

Combine two DataFrame objects with identical columns:

In [29]:
pd.concat([left, right])

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5
0   1   Billy       sub2
1   2   Brian       sub4
2   3    Bran       sub3
3   4   Bryce       sub6
4   5   Betty       sub5

Reset the above result by setting the ignore_index option to True:

In [30]:
pd.concat([left, right], ignore_index=True)

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5
5   1   Billy       sub2
6   2   Brian       sub4
7   3    Bran       sub3
8   4   Bryce       sub6
9   5   Betty       sub5

Add a hierarchical index at the outermost level of the data with the keys option:

In [35]:
pd.concat([left, right], keys=['a', 'b'])

     id    Name subject_id
a 0   1    Alex       sub1
  1   2     Amy       sub2
  2   3   Allen       sub4
  3   4   Alice       sub6
  4   5  Ayoung       sub5
b 0   1   Billy       sub2
  1   2   Brian       sub4
  2   3    Bran       sub3
  3   4   Bryce       sub6
  4   5   Betty       sub5

Label the index keys with the names option:

In [36]:
pd.concat([left, right], keys=['a', 'b'], names=['Series Nmae', 'Row ID'])

                    id    Name subject_id
Series Nmae Row ID
a           0        1    Alex       sub1
            1        2     Amy       sub2
            2        3   Allen       sub4
            3        4   Alice       sub6
            4        5  Ayoung       sub5
b           0        1   Billy       sub2
            1        2   Brian       sub4
            2        3    Bran       sub3
            3        4   Bryce       sub6
            4        5   Betty       sub5

Combine DataFrame objects with overlapping columns and return everything.<br> Columns outside the intersection will be filled with NaN values.

In [44]:
third = pd.DataFrame(
   {'id':[1,2,3],
   'Name': ['Rick', 'Morty', 'Loafy']})

third

   id   Name
0   1   Rick
1   2  Morty
2   3  Loafy

In [46]:
pd.concat([left, third], keys=['left', 'third'], sort=True)

           Name  id subject_id
left  0    Alex   1       sub1
      1     Amy   2       sub2
      2   Allen   3       sub4
      3   Alice   4       sub6
      4  Ayoung   5       sub5
third 0    Rick   1        NaN
      1   Morty   2        NaN
      2   Loafy   3        NaN

Combine DataFrame objects with overlapping columns and return only those that are shared by passing inner to the join keyword argument.

In [50]:
pd.concat([left, third], keys=['left', 'third'], join='inner')

         id    Name
left  0   1    Alex
      1   2     Amy
      2   3   Allen
      3   4   Alice
      4   5  Ayoung
third 0   1    Rick
      1   2   Morty
      2   3   Loafy

Combine DataFrame objects horizontally along the x axis by passing in axis=1:

In [53]:
pd.concat([left, third], keys=['left', 'third'], join='inner', axis=1)

  left                   third
    id   Name subject_id    id   Name
0    1   Alex       sub1     1   Rick
1    2    Amy       sub2     2  Morty
2    3  Allen       sub4     3  Loafy

<br>

### <span style="color:#130654">append()</span>

`append()` function is used to append rows of other to the end of caller, returning a new object.

Columns in other that are not in the caller are added as new columns.

*Syntax:*
```python
DataFrame.append(self, other, ignore_index=False, verify_integrity=False, sort=None)
```

|         Name         | Description                                                  | Type                                                   | Default | Required |
| :------------------: | :----------------------------------------------------------- | :----------------------------------------------------- | ------- | :------- |
|      **other**       | The data to append.                                          | DataFrame or Series/dict-like object, or list of these |         | Required |
|   **ignore_index**   | If True, do not use the index labels.                        | bool                                                   | False   | Required |
| **verify_integrity** | If True, raise ValueError on creating index with duplicates. | bool                                                   | False   | Required |
|       **sort**       | Sort columns if the columns of self and other are not aligned. | bool                                                   | None    | Required |

*Returns:* 
> DataFrame

In [62]:
left.append(right, ignore_index=True)

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5
5   1   Billy       sub2
6   2   Brian       sub4
7   3    Bran       sub3
8   4   Bryce       sub6
9   5   Betty       sub5

<br>

### <span style="color:#130654">update()</span>

`update()` function is used to modify in place using non-NA values from another DataFrame.

Aligns on indices. There is no return value

*Syntax:*
```python
DataFrame.update(self, other, join='left', overwrite=True, filter_func=None, errors='ignore')
```

|      Name       | Description                                                  | Type                                            | Default  | Required |
| :-------------: | :----------------------------------------------------------- | :---------------------------------------------- | -------- | :------- |
|    **other**    | Should have at least one matching index/column label with the original DataFrame. If a Series is passed, its name attribute must be set, and that will be used as the column name to align with the original DataFrame. | DataFrame, or object coercible into a DataFrame |          | Required |
|    **join**     | Only left join is implemented, keeping the index and columns of the original object. | 'left'                                          | 'left'   | Required |
|  **overwrite**  | How to handle non-NA values for overlapping keys:<br />1. True: overwrite original DataFrame's values with values from other.<br />2. False: only update values that are NA in the original DataFrame. | bool                                            | True     | Required |
| **filter_func** | Can choose to replace values other than NA. Return True for values that should be updated. | callable(1d-array) -> bool 1d-array             |          | Optional |
|   **errors**    | If 'raise', will raise a ValueError if the DataFrame and other both contain non-NA data in the same place. Changed in version 0.24.0: Changed from raise_conflict=False\|True to errors='ignore'\|'raise'.. | {'raise', 'ignore'}                             | 'ignore' | Required |

*Returns:* 
> None - method directly changes calling object

*Raises:* ValueError
- When errors='raise' and there's overlapping non-NA data.
- When errors is not either 'ignore' or 'raise'

In [63]:
new_df = pd.DataFrame({
   'id':[6,7],
   'Name': ['BoJack', 'Spongebob'],
   'subject_id':['sub6', 'sub7']})

In [66]:
left.update(new_df)
left

    id       Name subject_id
0  6.0     BoJack       sub6
1  7.0  Spongebob       sub7
2  3.0      Allen       sub4
3  4.0      Alice       sub6
4  5.0     Ayoung       sub5

<br>